In [3]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
from IPython.display import display

In [4]:
s = pd.Series([1, 3, 5, np.nan, 9, 11])
display(s)
print(type(s))

0     1.0
1     3.0
2     5.0
3     NaN
4     9.0
5    11.0
dtype: float64

<class 'pandas.core.series.Series'>

In [5]:
df = pd.DataFrame(np.random.randn(4, 4), index=list('ABCD'), columns=list('EFGH'))
print(df)

          E         F         G         H
A -0.545505 -0.601619  0.819866  0.266561
B -1.427886 -1.138492 -0.113550 -1.211808
C -0.468663 -0.222910  0.417675  1.237857
D  1.555137  0.841066 -0.211034  0.072002

In [6]:
df = pd.DataFrame(np.random.randn(10, 2))
print(df.head())
display(df.head())

          0         1
0  0.011859  1.927105
1  0.913803  2.362910
2 -0.897415 -0.077333
3 -0.262797 -0.584734
4  0.069400 -0.597066

          0         1
0  0.011859  1.927105
1  0.913803  2.362910
2 -0.897415 -0.077333
3 -0.262797 -0.584734
4  0.069400 -0.597066

In [7]:
display(df.head(3))

          0         1
0  0.011859  1.927105
1  0.913803  2.362910
2 -0.897415 -0.077333

In [8]:
display(df.tail(3))

          0         1
7  0.066899  1.892431
8  0.133695  1.010760
9 -1.738281 -1.129752

In [9]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [10]:
l = list(df.index)
print(l)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [11]:
df.columns

RangeIndex(start=0, stop=2, step=1)

In [12]:
print(list(df.columns))

[0, 1]

In [13]:
df.values

array([[ 0.01185924,  1.92710459],
       [ 0.91380329,  2.36290965],
       [-0.89741458, -0.07733279],
       [-0.26279665, -0.58473415],
       [ 0.06939991, -0.59706618],
       [-0.64742266, -0.03033263],
       [ 0.92976315,  0.05802782],
       [ 0.0668994 ,  1.89243135],
       [ 0.13369483,  1.01075989],
       [-1.7382813 , -1.12975201]])

In [14]:
df.describe()

               0          1
count  10.000000  10.000000
mean   -0.142050   0.483202
std     0.805551   1.227019
min    -1.738281  -1.129752
25%    -0.551266  -0.457884
50%     0.039379   0.013848
75%     0.117621   1.672013
max     0.929763   2.362910

In [15]:
display(df)

          0         1
0  0.011859  1.927105
1  0.913803  2.362910
2 -0.897415 -0.077333
3 -0.262797 -0.584734
4  0.069400 -0.597066
5 -0.647423 -0.030333
6  0.929763  0.058028
7  0.066899  1.892431
8  0.133695  1.010760
9 -1.738281 -1.129752

In [16]:
display(df.sort_values(by=0))

          0         1
9 -1.738281 -1.129752
2 -0.897415 -0.077333
5 -0.647423 -0.030333
3 -0.262797 -0.584734
0  0.011859  1.927105
7  0.066899  1.892431
4  0.069400 -0.597066
8  0.133695  1.010760
1  0.913803  2.362910
6  0.929763  0.058028

In [17]:
display(df.sort_index(axis=1, ascending=False))

          1         0
0  1.927105  0.011859
1  2.362910  0.913803
2 -0.077333 -0.897415
3 -0.584734 -0.262797
4 -0.597066  0.069400
5 -0.030333 -0.647423
6  0.058028  0.929763
7  1.892431  0.066899
8  1.010760  0.133695
9 -1.129752 -1.738281

In [20]:
df = pd.DataFrame(
    [
        ['yasin', 10],
        ['hassan', 13],
        ['ali', 24]
    ],
    columns = ['Name', 'Age']
)

display(df)

     Name  Age
0   yasin   10
1  hassan   13
2     ali   24

In [30]:
print(type(df))
print(type(df['Name']))
print(type(df.values))
print(type(df.index))
print(type(df.columns))

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>
<class 'numpy.ndarray'>
<class 'pandas.indexes.range.RangeIndex'>
<class 'pandas.indexes.base.Index'>

In [40]:
df = pd.DataFrame({
        'Name': pd.Series(['Yasin', 'Ali', 'Hassan'], dtype=np.str),
        'Age': [12.0, 17, 15]
    })

display(df)
print(df.dtypes)

    Age    Name
0  12.0   Yasin
1  17.0     Ali
2  15.0  Hassan

Age     float64
Name     object
dtype: object

In [41]:
display(df.T)

          0    1       2
Age      12   17      15
Name  Yasin  Ali  Hassan

In [42]:
display(df.Name)

0     Yasin
1       Ali
2    Hassan
Name: Name, dtype: object

In [45]:
display(df['Name'])

0     Yasin
1       Ali
2    Hassan
Name: Name, dtype: object

In [47]:
display(df[0:2])

    Age   Name
0  12.0  Yasin
1  17.0    Ali

In [51]:
display(df.loc[:, ['Name']])

     Name
0   Yasin
1     Ali
2  Hassan

In [58]:
display(df[['Name', 'Age']])

     Name   Age
0   Yasin  12.0
1     Ali  17.0
2  Hassan  15.0

In [63]:
display(df.iloc[2])

Age         15
Name    Hassan
Name: 2, dtype: object

In [69]:
display(df.iloc[0:2, 0:2])

    Age   Name
0  12.0  Yasin
1  17.0    Ali

In [70]:
df.Age > 12

0    False
1     True
2     True
Name: Age, dtype: bool

In [71]:
display(df[df.Age > 12])

    Age    Name
1  17.0     Ali
2  15.0  Hassan

In [80]:
df['City'] = ['Gachsaran', 'Shiraz', 'Mashhad']
display(df)

    Age    Name       City
0  12.0   Yasin  Gachsaran
1  17.0     Ali     Shiraz
2  15.0  Hassan    Mashhad

In [82]:
df[df['City'].isin(['Tehran', 'Shiraz'])]

    Age Name    City
1  17.0  Ali  Shiraz

In [85]:
df > 0

    Age  Name  City
0  True  True  True
1  True  True  True
2  True  True  True

In [88]:
df.isnull()

     Age   Name   City
0  False  False  False
1  False  False  False
2  False  False  False

In [94]:
df.mean(0)

Age    14.666667
dtype: float64

In [97]:
df.apply(lambda x: len(x))

Age     3
Name    3
City    3
dtype: int64